Revit 2026 API

# TypeBinding Properties

---

The TypeBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieve or set the categories to which a parameter definition will be bound.(Inherited from ElementBinding) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

TypeBinding Class

Autodesk.Revit.DB Namespace